# Toposolid Create Sub Division(Document, Element Id, IList Curve Loop ) Method

Source: https://www.revitapidocs.com/2026/6b4bcf67-0432-9549-dafb-464f8ca07eec.htm

---

| Toposolid Create Sub Division(Document, Element Id, IList Curve Loop ) Method |
| --- |

**Namespace:** Autodesk.Revit.DB
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public Toposolid CreateSubDivision(
	Document document,
	ElementId topoTypeId,
	IList<CurveLoop> profiles
)
```

```
Public Function CreateSubDivision (
	document As Document,
	topoTypeId As ElementId,
	profiles As IList(Of CurveLoop)
) As Toposolid
```

```
public:
Toposolid^ CreateSubDivision(
	Document^ document,
	ElementId^ topoTypeId,
	IList<CurveLoop^>^ profiles
)
```

```
member CreateSubDivision :
        document : Document *
        topoTypeId : ElementId *
        profiles : IList<CurveLoop> -> Toposolid
```

#### Parameters

document Document
topoTypeId ElementId
profiles IList CurveLoop

#### Return Value

Toposolid See Also

#### Reference

Toposolid Class CreateSubDivision Overload Autodesk.Revit.DB Namespace